using System;

namespace _01.GDPR
{
    class Program
    {
        static void Main(string[] args)
        {
            //            1.За всеки един достъп до лични данни в „Софтуерна система“, трябва да се
            //въведат(съхранят):
            //-име на оператора на лични данни(знаков низ, с дължина 100 знака);
            //            -дата и час на извършване на операцията(година, месец, ден, час и минута);
            //            -вид на извършената операция(цяло число): като 1 означава 'нови данни',
            //2 - 'промяна на данни', 3 - 'изтриване на данни', 4 - 'справка с лични данни';
            //            -коментар(знаков низ с дължина 200 знака): ако операцията е 4, коментарът
            //          съдържа името на справката в "Софтуерната система", в противен случай
            //          коментарът съдържа съответно новите, променените или изтрити лични данни.
            //Броят на записаните операции е по-малък от 1000.
            //2.Извежда на екрана информация за извършените операции с лични данни,
            //сортирани по времето на извършване на операцията.За всяка операция на отделен ред се
            //извежда: дата, час, име на оператор, име на операцията и коментар.Например:
            //05.06.2018; 12:30; Иван Георгиев; нови данни; Георги Петров, gosho3@mail.bg
            //3.Извежда справка, в която списъкът от операции да е сортиран по азбучен ред на
            //името на оператора, а за един и същи оператор операциите да са сортирани по азбучен
            //ред на коментара.В началото на всеки ред да се изведе последователен номер на
            //операция за всеки оператор.
            //4.Да се намери оператора с най - много общо извършени операции.Да се изведат
            //името на оператора, броя на направените от него справки с лични данни(операция 4) и
            //броя на въведените нови лични данни(операция 1).

            string starCName;

            Console.WriteLine("Моля веведете име на звездата");
            string starName = Console.ReadLine();
            Console.WriteLine("Моля въведете класификация на звездата");
            int starC = int.Parse(Console.ReadLine());
            if (!(starC>9))
            {
                if (starC == 1)
                {
                    starCName = "Голяма звезда";
                }
               else if (starC == 2)
                {
                    starCName = "Голяма планетна звезда";
                }
                else if (starC == 3)
                {
                    starCName = "Голяма хуйна звезда";
                }
                else if (starC == 4)
                {
                    starCName = "Голяма тромава звезда";
                }
                else if (starC == 5)
                {
                    starCName = "Голяма бяла звезда";
                }
                else if (starC == 6)
                {
                    starCName = "Голяма идиотска звезда";
                }
                else if (starC == 7)
                {
                    starCName = "Нямам думи просто";
                }
                else if (starC == 8)
                {
                    starCName = "Колко е тъпо това нещо";
                }
                else
                {
                    starCName = "УЖАС";
                }
            }
            else
            {
                Console.WriteLine("Звездите може да са до 9");
                Console.WriteLine("Моля въведете отново");
               
            }




        }
    }
}
