using System;
class Yard
{
    static void Main()
    {
        double kvm = double.Parse(Console.ReadLine());
        double price = 7.61 * kvm;
        double discount = price * 0.18;
        double price2 = price - discount;
        Console.WriteLine("The price is {0:F2}", price);
        Console.WriteLine("The discount is {0:F2}", discount);
        Console.WriteLine("The final price with the discount is {0:F2}", price2);
    }
}

















//9. Озеленяване на дворове
//Божидара разполага с няколко къщи на Черноморието и желае да озелени дворовете на някои от тях, като
//по този начин създаде уютна обстановка и комфорт на гостите си, като за целта е наела фирма.
//Напишете програма, която изчислява необходимите средства, които Божидара ще трябва да заплати на
//фирмата изпълнител на проекта.Цената на един кв.м.е 7.61лв със ДДС.Тъй като нейният двор е доста
//голям, фирмата изпълнител предлага 18% отстъпка от крайната цена.
//Вход
//От конзолата се прочита само един ред:
//1. Кв.метри, които ще бъдат озеленени – реално число в интервала [0.00… 10000.00]
//Изход
//На конзолата се отпечатват два реда:
// &quot; The final price is: {крайна цена на услугата} lv.&quot;
// &quot;The discount is: {отстъпка} lv.&quot;
//И двете суми трябва да бъдат форматирани до втората цифра след десетичния знак.